<a href="https://colab.research.google.com/github/medicalmom/M8-activities/blob/master/Copy_of_Untitled0M8MB.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
mv_data = pd.read_csv('https://data.cityofnewyork.us/resource/h9gi-nx95.csv?$limit=30000')

### We import the data set from nypd motor vehicle crash and limit 30,000 rows to work with some of the dataset.

### Next, look at the number of rows and columns in the data set imported using shape command

In [2]:
mv_data.shape

(30000, 29)

### We have 30,000 rows and 29 columns of data in the information imported. Let's put it into an array with headers for each column

In [3]:
mv_data.head()

                      date   time  ... vehicle_type_code_4  vehicle_type_code_5
0  2013-08-03T00:00:00.000  18:00  ...                 NaN                  NaN
1  2013-08-10T00:00:00.000  11:20  ...                 NaN                  NaN
2  2013-07-19T00:00:00.000  17:30  ...                 NaN                  NaN
3  2013-07-19T00:00:00.000  17:10  ...                 NaN                  NaN
4  2013-07-29T00:00:00.000  10:30  ...                 NaN                  NaN

[5 rows x 29 columns]

### We take a look at the columns and what each contains. Look at the mean, standard deviation, counts for information present, minimum, maximum and percentiles to see what the variance is.

In [4]:
mv_data.describe()

           zip_code      latitude  ...  number_of_motorist_killed    unique_key
count  22018.000000  24534.000000  ...               30000.000000  3.000000e+04
mean   10793.974248     40.722929  ...                   0.000633  6.811260e+05
std      569.831306      0.077185  ...                   0.026450  1.194047e+06
min    10000.000000     40.499842  ...                   0.000000  2.941000e+03
25%    10040.000000     40.669477  ...                   0.000000  9.067775e+04
50%    11203.000000     40.724136  ...                   0.000000  1.813995e+05
75%    11235.000000     40.765359  ...                   0.000000  2.765152e+05
max    11697.000000     40.912019  ...                   2.000000  4.229003e+06

[8 rows x 12 columns]

### We can also look at the mixed data types and see if there are missing values. Use .info to look:

In [5]:
mv_data.info

<bound method DataFrame.info of                           date   time  ... vehicle_type_code_4  vehicle_type_code_5
0      2013-08-03T00:00:00.000  18:00  ...                 NaN                  NaN
1      2013-08-10T00:00:00.000  11:20  ...                 NaN                  NaN
2      2013-07-19T00:00:00.000  17:30  ...                 NaN                  NaN
3      2013-07-19T00:00:00.000  17:10  ...                 NaN                  NaN
4      2013-07-29T00:00:00.000  10:30  ...                 NaN                  NaN
...                        ...    ...  ...                 ...                  ...
29995  2019-10-20T00:00:00.000   9:10  ...                 NaN                  NaN
29996  2019-10-13T00:00:00.000  19:44  ...                 NaN                  NaN
29997  2019-10-06T00:00:00.000   4:00  ...                 NaN                  NaN
29998  2019-09-29T00:00:00.000  13:00  ...                 NaN                  NaN
29999  2019-10-03T00:00:00.000   9:18  ...                 NaN                  NaN

[30000 rows x 29 columns]>

##**The mv_data data set needs to have some data cleaned up and some removed.** Here are some of the things I noted and would like to change:

####Data column - these dates need to have decimal removed, so make integer rather than float

####Date and Time columns - would be ideal to combine these columns and make a timestamp

####zip_code column - remove the NAN and Nan rows, make these numbers integer and not float

####vehicle_type_code columns - consider removing the columns for vehicles 3, 4, and 5 since there are alot of NaN values and will likely look at just the first vehicle involved. 

####unique_key column - this is probably not useful information for our purposes and could remove this column.

####contributing_factor_vehicle - could consider removing the columns for vehicles 3, 4, and 5 as there are alot of NaN values.

#### Let's drop the column unique_key and then find the percent of NaN values in the remaining columns, looking especially at the columns we just considered dropping.

In [0]:
new_mv_data = mv_data.drop(columns = ["unique_key"])
new_mv_data.isnull().mean()*100

date                              0.000000
time                              0.000000
borough                          26.606667
zip_code                         26.606667
latitude                         18.220000
longitude                        18.220000
location                         18.220000
on_street_name                   16.060000
off_street_name                  17.326667
cross_street_name                96.420000
number_of_persons_injured         0.000000
number_of_persons_killed          0.000000
number_of_pedestrians_injured     0.000000
number_of_pedestrians_killed      0.000000
number_of_cyclist_injured         0.000000
number_of_cyclist_killed          0.000000
number_of_motorist_injured        0.000000
number_of_motorist_killed         0.000000
contributing_factor_vehicle_1     0.126667
contributing_factor_vehicle_2    11.013333
contributing_factor_vehicle_3    93.140000
contributing_factor_vehicle_4    98.643333
contributing_factor_vehicle_5    99.726667
vehicle_type_code1                0.023333
vehicle_type_code2                9.763333
vehicle_type_code_3              93.140000
vehicle_type_code_4              98.640000
vehicle_type_code_5              99.730000
dtype: float64

#### We will drop the columns with greater than 90% of values that are missing or NaN and create new data frame, new_mv_data1

In [21]:
new_mv_data1 = mv_data.drop(columns = ["unique_key", "cross_street_name", "contributing_factor_vehicle_3", "contributing_factor_vehicle_4", "contributing_factor_vehicle_5", "vehicle_type_code_3", "vehicle_type_code_4", "vehicle_type_code_5"])
new_mv_data1.head()

                      date  ...             vehicle_type_code2
0  2013-08-03T00:00:00.000  ...              PASSENGER VEHICLE
1  2013-08-10T00:00:00.000  ...              PASSENGER VEHICLE
2  2013-07-19T00:00:00.000  ...  SPORT UTILITY / STATION WAGON
3  2013-07-19T00:00:00.000  ...              PASSENGER VEHICLE
4  2013-07-29T00:00:00.000  ...  SPORT UTILITY / STATION WAGON

[5 rows x 21 columns]

#### Now we can find the unique types of vehicles involved in these crashes. Look at vehicle number one, the first vehicle impacting. This column value is vehicle_type_code1. Here are the first five types of vehicles by numbers.

In [22]:
mv_data['vehicle_type_code1'].head(5)

0                  SUV
1    PASSENGER VEHICLE
2    PASSENGER VEHICLE
3    PASSENGER VEHICLE
4                  SUV
Name: vehicle_type_code1, dtype: object

Find the unique types of vehicle for vehicle 1 involved in crash, and find numbers of each of these vehicles.

In [0]:
mv_data['vehicle_type_code1'].unique()

array(['Bus', 'Van', 'SUV', 'Sedan', 'Tractor Truck Diesel', 'Taxi',
       'E-Sco', 'Pick-up Truck', 'E-Bik', 'Dump', 'Motorbike',
       'Box Truck', 'Ambulance', 'DELIV', 'Motorscooter', nan,
       'Chassis Cab', 'MOPED', 'PASSENGER VEHICLE', 'UNKNOWN', 'VAN',
       'SMALL COM VEH(4 TIRES) ', 'PICK-UP TRUCK', 'OTHER', 'TAXI',
       'MOTORCYCLE', 'BUS', 'LIVERY VEHICLE', 'Motorcycle',
       'Tractor Truck Gasoline', 'Trail', 'TRUCK', 'Garbage or Refuse',
       'Moped', 'Minicycle', 'usps', 'tow t', 'MOPD', 'Bike', 'STREE',
       'TRACK', 'PK', 'CRANE', 'Flat Bed', 'AMBULANCE',
       'LARGE COM VEH(6 OR MORE TIRES)', 'Ambul', 'motor', 'Convertible',
       'Tow Truck / Wrecker', 'FDNY', 'Carry All', '3-Door', 'FIRE', 'MS',
       'BU', 'CONV', 'Tanker', 'TK', 'BULLD', 'VN', 'NYPD', 'FB', 'GG',
       'DS', 'AM', 'TOW T', 'CB', 'TOW', 'LL', 'DP', 'FORKL', 'BICYCLE',
       'UTILI', 'RESCU', 'SCOOTER', '4 dr sedan', 'FIRE TRUCK'],
      dtype=object)

In [16]:
mv_data['vehicle_type_code1'].value_counts()

PASSENGER VEHICLE                      16146
SPORT UTILITY / STATION WAGON           6570
TAXI                                    1136
VAN                                     1008
OTHER                                    786
UNKNOWN                                  621
LARGE COM VEH(6 OR MORE TIRES)           541
Sedan                                    527
SMALL COM VEH(4 TIRES)                   492
BUS                                      456
PICK-UP TRUCK                            445
Station Wagon/Sport Utility Vehicle      336
LIVERY VEHICLE                           307
MOTORCYCLE                               248
AMBULANCE                                 84
Taxi                                      52
Pick-up Truck                             41
Box Truck                                 28
BICYCLE                                   23
Bus                                       21
FIRE TRUCK                                19
Bike                                      16
Tractor Truck Diesel                      13
Van                                       10
SCOOTER                                   10
Motorcycle                                 9
Ambulance                                  5
Dump                                       5
Flat Bed                                   5
PK                                         5
PEDICAB                                    3
4 dr sedan                                 3
Motorbike                                  2
LIMO                                       2
Tractor Truck Gasoline                     2
TRACT                                      2
RMP V                                      1
E-Bik                                      1
AMBUL                                      1
2015                                       1
ambul                                      1
Tanker                                     1
Chassis Cab                                1
E-Sco                                      1
Moped                                      1
DOT T                                      1
BOX                                        1
Carry All                                  1
GARBA                                      1
Convertible                                1
Name: vehicle_type_code1, dtype: int64

In [0]:

top_vehicles = mv_data['vehicle_type_code1'].value_counts().head(5)

Also, I would like to take a look to see how many unique on street names there are and what the value counts are for each of these. We could focus on the streets that recur the most times and look specifically at these streets to find out if anything stands out with other facors.

In [9]:
mv_data['on_street_name'].unique()

array(['86 STREET                       ',
       'SEABURY STREET                  ',
       'WEST FORDHAM ROAD               ', ...,
       'EDGEWATER STREET                ',
       'JARRETT PLACE                   ',
       'LOUISA STREET                   '], dtype=object)

In [10]:
mv_data['on_street_name'].value_counts()

BROADWAY                            369
ATLANTIC AVENUE                     293
NORTHERN BOULEVARD                  260
FLATBUSH AVENUE                     215
QUEENS BOULEVARD                    192
                                   ...
BUD PLACE                             1
146 TERRACE                           1
DUPONT STREET                         1
138 AVENUE                            1
140 AVENUE                            1
Name: on_street_name, Length: 3207, dtype: int64

### We can look also at the off street names and see what the unique names are and how many of each of these there are.

In [11]:
mv_data['off_street_name'].unique()

array(['WEST 6 STREET                   ',
       '54 AVENUE                       ',
       'MAJOR DEEGAN EXPRESSWAY         ', ..., 'EAST 61 STREET',
       'WEST 11 STREET', 'RICHMOND AVENUE'], dtype=object)

In [13]:
mv_data['off_street_name'].value_counts()

BROADWAY                            361
3 AVENUE                            341
2 AVENUE                            304
7 AVENUE                            271
8 AVENUE                            254
                                   ...
102 CROSS DRIVE                       1
DANIELS STREET                        1
EAST 75 STREET                        1
HOPE STREET                           1
MAGENTA STREET                        1
Name: off_street_name, Length: 4083, dtype: int64

### sports utility/station wagon, sedan, and then station wagon/sport utility were the largest number of vehicles involved in the crashes. We could maybe combine sports utility/station wagon and station wagon/sport utility groups.

In [0]:
mv_data['vehicle_type_code1'] = mv_data['vehicle_type_code1'].str.replace('SPORT UTILITY / STATION WAGON', 'SUV')
mv_data['vehicle_type_code1'] = mv_data['vehicle_type_code1'].str.replace('Station Wagon/Sport Utility Vehicle', 'SUV')

### Once the cell is run, sport utility / station wagon and station wagon/sport utility vehicle will be seen as SUV in the above dataframe.

In [0]:
number_injured = ("number_of_pedestrians_injured" + "number_of_motorist_injured" + "number_of_cyclist_injured")

### Add the column number_injured to our dataframe new_mv_data1. This will give us a column with the number total injured over all groups.

In [27]:
new_mv_data1.insert("number_injured")

TypeError: ignored

###I would like to add this column to my dataframe.

The NYPD Motor Vehicle Crash Data set has had some cleaning and prepping. We could do more and also do further analysis